# Pandas

In [1]:
import pandas as pd
import numpy as np

## Series: Collection of labelled data

In [2]:
s1=pd.Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
s2=pd.Series([10,20,30,40],index=['A','B','C','D'])
s2

A    10
B    20
C    30
D    40
dtype: int64

## Different ways to create series

In [7]:
s1=pd.Series(np.random.randint(1,50,5))
s1

0    36
1    33
2     8
3    39
4     6
dtype: int32

In [8]:
s1.index=['A','B','C','D','E']
s1

A    36
B    33
C     8
D    39
E     6
dtype: int32

In [10]:
s1['A']

np.int32(36)

In [11]:
toppers=pd.Series({'IT':78,'Mech':77,'Civil':80})
toppers

IT       78
Mech     77
Civil    80
dtype: int64

## Operations on series

In [13]:
s1=pd.Series([10,20,30,40])
s2=pd.Series([1,2,3,4])
s1+s2

0    11
1    22
2    33
3    44
dtype: int64

In [14]:
# Labelwise opeartions
s1=pd.Series([10,20,30,40],index=['A','B','C','D'])
s2=pd.Series([1,2,3,4],index=['C','D','G','H'])
s1+s2

A     NaN
B     NaN
C    31.0
D    42.0
G     NaN
H     NaN
dtype: float64

In [15]:
s2

C    1
D    2
G    3
H    4
dtype: int64

In [17]:
s2[s2%2==0]  # Conditional selection

D    2
H    4
dtype: int64

## DataFrame

In [2]:
arr1=np.arange(2,41,2).reshape(4,5)
df=pd.DataFrame(arr1)
df.columns=['C1','C2','C3','C4','C5']
df

   C1  C2  C3  C4  C5
0   2   4   6   8  10
1  12  14  16  18  20
2  22  24  26  28  30
3  32  34  36  38  40

In [3]:
# DataFrame using List
students=pd.DataFrame([[1,'Abhi',56,'M'],
                       [2,'Sahil',60,'M'],
                       [3,'Tanvi',55,'F']],
            columns=['RollNo','Name','Marks','Gender'])
students

   RollNo   Name  Marks Gender
0       1   Abhi     56      M
1       2  Sahil     60      M
2       3  Tanvi     55      F

In [5]:
# DataFrame using Dictionary
emp=pd.DataFrame({'Eid':[101,102,103,104],
                  'Name':['Shhubham','Prachi','Jai','Vaibhav'],
                 'Salary':[23000,40000,27000,34000]})
emp

   Eid      Name  Salary
0  101  Shhubham   23000
1  102    Prachi   40000
2  103       Jai   27000
3  104   Vaibhav   34000